DataProcessors/umk_ПроведениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>umk_ПроведениеДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПорция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПорциями</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопытками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровестиПоОтрицательным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокМетаданных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МетаданныеКПроведению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

DataProcessors/umk_ПроведениеДокументов/Ext/ObjectModule.bsl
// ПЕРЕМЕННЫЕ
Перем РодительскиеТипыОбъектовМетаданных;
Перем мФайлПротоколаДанных Экспорт; // файл для ведения протокола обмена данными


//ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ ТАБЛИЦ ОБРАБОТКИ

// Процедуры заполнения списка к проведению
Процедура ПередатьКПроведению() Экспорт
	
	Для Каждого СтрокаИмен Из СписокМетаданных Цикл
		Если СтрокаИмен.Пометка Тогда
			СтрокаКПроведению = МетаданныеКПроведению.Добавить();
			СтрокаКПроведению.ИмяДокумента = СтрокаИмен.ИмяДокумента;
			СтрокаКПроведению.Синоним = СтрокаИмен.Синоним;
		КонецЕсли
	КонецЦИкла;
	
	МетаданныеКПроведению.Свернуть("ИмяДокумента, Синоним");
	
КонецПроцедуры

// Процедуры заполнения списка метаданных
Процедура ЗаполнитьСписокМетаданных()Экспорт
	
	РодительскиеТипыОбъектовМетаданных = Новый Структура;
	вДобавитьРодительскийТип(РодительскиеТипыОбъектовМетаданных,"Документ","Документы");
	вСчитатьИзКонфигурации();
	
КонецПроцедуры

// Процедура считывает структуру метаданных текущей конфигурации
// в дерево значений
Процедура вСчитатьИзКонфигурации()
	//ТекОтбор = ВладелецФормы.ЭлементыФормы.ПроводимыеОбъекты.ОтборСтрок.Метаданные;
	СписокМетаданных.Очистить();
	Для каждого  РодительскийТип Из  РодительскиеТипыОбъектовМетаданных Цикл
		Для каждого  ДочернийТип Из  Метаданные[РодительскийТип.Значение.ИмяМножественное] Цикл
			НоваяСтрока = СписокМетаданных.Добавить();
			НоваяСтрока.ИмяДокумента = СокрЛП(ДочернийТип.Имя);
			НоваяСтрока.Синоним = СокрЛП(ДочернийТип.Синоним);
			НоваяСтрока.Пометка = Истина;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура вДобавитьРодительскийТип(Типы,ДобавляемыйТип,ИмяМножественное,СтрокаСоставаМетаданных = "")
	Если Метаданные[ИмяМножественное].Количество() <> 0 Тогда
		СтруктураСоставаМетаданных = Новый Структура;
		Строка = СокрЛП(СтрокаСоставаМетаданных);
		Пока Строка <> "" Цикл
			ПозЗПТ = Найти(Строка,",");
			Если ПозЗПТ <>  0 Тогда
				СоставМетаданного = СокрЛП(Лев(СоставМетаданного,ПозЗПТ-1));
				Строка = СокрЛП(Сред(СоставМетаданного,ПозЗПТ+1));
			Иначе
				СоставМетаданного = СокрЛП(Строка);
				Строка = "";
			КонецЕсли;
			СтруктураСоставаМетаданных.Вставить(СоставМетаданного,Истина);
		КонецЦикла;
		Структура = Новый Структура;
		Структура.Вставить("ИмяМножественное",ИмяМножественное);
		Структура.Вставить("Метаданные",Метаданные[ИмяМножественное]);
		Структура.Вставить("СоставМетаданных",СтруктураСоставаМетаданных);
		Типы.Вставить(ДобавляемыйТип,Структура)
	КонецЕсли;
КонецПроцедуры // ДобавитьРодительскийТип()

// Возвращает массив документов для проведения
Функция ПолучитьМассивДокументов(МассивИмен)
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("Ссылка");
	ТаблицаДокументов.Колонки.Добавить("Дата");

	Если ПровестиПоОтрицательным Тогда // Проводим только по дукументам с отрицательными остатками по партиям, по счету 26
		
		// Номенклатура с отрицательным остатком
		
		СчетаОстатков = Новый Массив;
		СчетаОстатков.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СчетаОстатков", СчетаОстатков);
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.Субконто2,
		|	ХозрасчетныйОстатки.Субконто3,
		|	ХозрасчетныйОстатки.Субконто4,
		|	ХозрасчетныйОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОкончания, Счет В (&СчетаОстатков), , Организация = &Организация) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.КоличествоОстаток < 0" ;
		
		Результат = Запрос.Выполнить().Выгрузить();
		Результат.Свернуть("Субконто1");
		МассивНоменклатуры = Результат.ВыгрузитьКолонку("Субконто1");
		
		// Выберим документы движения с этими позициями 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Регистратор КАК Ссылка,
		|	ХозрасчетныйОбороты.Субконто1,
		|	ХозрасчетныйОбороты.Счет,
		|	ХозрасчетныйОбороты.Регистратор.Дата КАК РегистраторДата
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Счет В (&МассивСчетов),
		|			,
		|			Субконто1 В (&Номенклатура)
		|				И Организация = &Организация,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	НЕ ТИПЗНАЧЕНИЯ(ХозрасчетныйОбороты.Регистратор) = ТИП(Документ.ОтчетПроизводстваЗаСмену)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегистраторДата";
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
		Запрос.УстановитьПараметр("МассивСчетов", СчетаОстатков);
		Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
		Запрос.УстановитьПараметр("Организация",Организация);
		
		ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
		ТаблицаДокументов.Свернуть("Ссылка");
		
		Возврат ТаблицаДокументов.ВыгрузитьКолонку("Ссылка");
		
		
	Иначе
		
		
		
		Для Каждого ИмяДокумента Из МассивИмен Цикл
			
			
			Текст = 
			"ВЫБРАТЬ
			|	%ИмяДокумента%.Ссылка,
			|	%ИмяДокумента%.Дата КАК Дата
			|ИЗ
			|	Документ.%ИмяДокумента% КАК %ИмяДокумента%
			|ГДЕ
			|	%ИмяДокумента%.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И %ИмяДокумента%.ПометкаУдаления = ЛОЖЬ
			|	И %ИмяДокумента%.Проведен = ИСТИНА
			|	И %ИмяДокумента%.Организация = &Организация
			|
			|УПОРЯДОЧИТЬ ПО
		    |	Дата" ;
			
			
			Текст = СтрЗаменить(Текст,"%ИмяДокумента%", ИмяДокумента); 
			
			
			Запрос = Новый Запрос(Текст);
			Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
			Запрос.УстановитьПараметр("Организация", Организация);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Строка Из Результат Цикл
				
				НоваяСтрока = ТаблицаДокументов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
			КонецЦикла
			
		КонецЦикла;
		
		ТаблицаДокументов.Сортировать("Дата Возр");
		
		Возврат ТаблицаДокументов.ВыгрузитьКолонку("Ссылка");
		
	КонецЕсли;
	
КонецФункции

// ОБРАБОТКА ПРОВЕДЕНИЯ ДОКУМЕНТОВ
Процедура ПровестиДокументы()Экспорт
	
	ИнициализироватьВедениеПротоколаОбмена();
	
	МассивИмен = МетаданныеКПроведению.ВыгрузитьКолонку("ИмяДокумента");
	
	ПроводимыеДокументы = ПолучитьМассивДокументов(МассивИмен);
	
	
	Форма = ПолучитьФорму("Форма");
	
	Если Форма.Открыта() Тогда
		Прогресс = Форма.ЭлементыФормы.Индикатор;
		Прогресс.Значение = 0;
		Прогресс.МаксимальноеЗначение = ПроводимыеДокументы.Количество();
	КонецЕсли;
	
	
	НомерДокументаВПорции = 0;
	
	Для Каждого ДокументСсылка Из ПроводимыеДокументы Цикл
		
		ОбработкаПрерыванияПользователя();
		
		
		Если НомерДокументаВПорции >= ДокументПорция
			Тогда
			umk_Доработки.Пауза(ПаузаМеждуПорциями);
			НомерДокументаВПорции = 0
		КонецЕсли;
		
		Состояние(ДокументСсылка.Ссылка);
		ЗаписатьВПротоколВыполнения("Начало проведения: " + Строка(ДокументСсылка.Ссылка));
		
		ДокументПроведен = ПровестиДокументОбъект(ДокументСсылка.Ссылка);
		
		Если Не ДокументПроведен  Тогда
			Текст = Строка(ТекущаяДата()) + ". Операция прервана при попытке проведения документа: " + Строка(ДокументСсылка.Ссылка);
			Сообщить(Текст, СтатусСообщения.ОченьВажное);
			ЗаписатьВПротоколВыполнения(Текст);
			ЗавершитьВедениеПротокола();
			Возврат
		КонецЕсли;
		
		НомерДокументаВПорции = НомерДокументаВПорции +1;
		
		
		Если Форма.Открыта() тогда
			
			Прогресс.Значение = Прогресс.Значение + 1;	
			
		КонецЕсли;
		
		
	КонецЦикла; // По проводимым документам
	
	ЗавершитьВедениеПротокола();
			
	#Если Клиент Тогда
		
	#КонецЕсли

	
Конецпроцедуры

Функция  ПровестиДокументОбъект(ДокументСсылка)
	
	Попытка
		Документ = ДокументСсылка.ПолучитьОбъект();
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
		ЗаписатьВПротоколВыполнения(ОписаниеОшибки());
		
		ЗавершитьВедениеПротокола();
		
		Возврат Ложь;
		
	КонецПопытки;

	
	ДокументЗаписан = Ложь;
	
	Если Документ.Проведен Тогда
		ЗаписатьДокумент(Документ, 0, ДокументЗаписан);
	КонецЕсли;
	
	Возврат ДокументЗаписан
	
КонецФункции

Процедура ЗаписатьДокумент(ДокументОбъект, НомерПопытки, ДокументЗаписан, ПерваяПопытка = Истина)
	
	ОбработкаПрерыванияПользователя();
	
	Если Не  ПерваяПопытка Тогда
		
		umk_Доработки.Пауза(ПаузаМеждуПопытками);
		
	КонецЕсли;
	
	Если НомерПопытки >= КоличествоПопыток И Не ПерваяПопытка
		
		Тогда
		
		ДокументЗаписан = Ложь;
		
		Возврат
		
	КонецЕсли;
	
	
	Попытка						
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
		ДокументЗаписан = Истина;
		
		Возврат 
		
	Исключение
		
		НомерПопытки = НомерПопытки + 1;
		ПерваяПопытка = Ложь;
		
		ЗаписатьВПротоколВыполнения("Номер попытки:" + Строка(НомерПопытки));

		ЗаписатьВПротоколВыполнения(ОписаниеОшибки());
		
		ЗаписатьДокумент(ДокументОбъект, НомерПопытки, ДокументЗаписан, Ложь);
		
	КонецПопытки;

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ПРОТОКОЛОМ ОБМЕНА

// Выполняет инициализацию файла для записи событий 
//
// Параметры:
//  Нет.
// 
Процедура ИнициализироватьВедениеПротоколаОбмена() Экспорт
	
	Если ПустаяСтрока(ИмяФайлаПротокола) Тогда
		
		мФайлПротоколаДанных = Неопределено;
			
		Возврат;
		
	КонецЕсли;
	
	мФайлПротоколаДанных = Новый ЗаписьТекста(ИмяФайлаПротокола, КодировкаТекста.ANSI, , Истина) ;
	
КонецПроцедуры

// Закрывает файл протокола обмена данными. Файл сохраняется на диск
//
Процедура ЗавершитьВедениеПротокола() Экспорт 
	
	Если мФайлПротоколаДанных <> Неопределено Тогда
		
		мФайлПротоколаДанных.Закрыть();
				
	КонецЕсли;	
	
	мФайлПротоколаДанных = Неопределено;
	
КонецПроцедуры

// Сохраняет в протокол выполнения  сообщения  
// 
Процедура ЗаписатьВПротоколВыполнения(Текст) Экспорт
	
	Если мФайлПротоколаДанных <> Неопределено Тогда
		
		Текст = Строка(ТекущаяДата()) + " " + Текст;
		мФайлПротоколаДанных.ЗаписатьСтроку(Текст);	
		
	КонецЕсли;
			
КонецПроцедуры
